; domain
(define (domain blocksworld)
  (:requirements :strips)
(:predicates (clear ?x)
             (on-table ?x)
             (arm-empty)
             (holding ?x)
             (on ?x ?y))

(:action pickup
  :parameters (?ob)
  :precondition (and (clear ?ob) (on-table ?ob) (arm-empty))
  :effect (and (holding ?ob) (not (clear ?ob)) (not (on-table ?ob))
               (not (arm-empty))))

(:action putdown
  :parameters  (?ob)
  :precondition (holding ?ob)
  :effect (and (clear ?ob) (arm-empty) (on-table ?ob)
               (not (holding ?ob))))

(:action stack
  :parameters  (?ob ?underob)
  :precondition (and (clear ?underob) (holding ?ob))
  :effect (and (arm-empty) (clear ?ob) (on ?ob ?underob)
               (not (clear ?underob)) (not (holding ?ob))))

(:action unstack
  :parameters  (?ob ?underob)
  :precondition (and (on ?ob ?underob) (clear ?ob) (arm-empty))
  :effect (and (holding ?ob) (clear ?underob)
               (not (on ?ob ?underob)) (not (clear ?ob)) (not (arm-empty)))))

; problem
;; blocks=88, out_folder=htg/blocksworld//training, instance_id=68, seed=2092

(define (problem blocksworld-68)
 (:domain blocksworld)
 (:objects b1 b2 b3 b4 b5 b6 b7 b8 b9 b10 b11 b12 b13 b14 b15 b16 b17 b18 b19 b20 b21 b22 b23 b24 b25 b26 b27 b28 b29 b30 b31 b32 b33 b34 b35 b36 b37 b38 b39 b40 b41 b42 b43 b44 b45 b46 b47 b48 b49 b50 b51 b52 b53 b54 b55 b56 b57 b58 b59 b60 b61 b62 b63 b64 b65 b66 b67 b68 b69 b70 b71 b72 b73 b74 b75 b76 b77 b78 b79 b80 b81 b82 b83 b84 b85 b86 b87 b88 - object)
 (:init 
    (arm-empty)
    (clear b77)
    (on b77 b9)
    (on b9 b20)
    (on b20 b47)
    (on-table b47)
    (clear b75)
    (on b75 b63)
    (on b63 b83)
    (on-table b83)
    (clear b10)
    (on b10 b23)
    (on b23 b31)
    (on b31 b71)
    (on b71 b69)
    (on-table b69)
    (clear b85)
    (on b85 b88)
    (on-table b88)
    (clear b80)
    (on b80 b57)
    (on b57 b37)
    (on b37 b24)
    (on b24 b25)
    (on b25 b35)
    (on b35 b66)
    (on b66 b33)
    (on b33 b16)
    (on b16 b2)
    (on b2 b27)
    (on b27 b38)
    (on b38 b26)
    (on b26 b44)
    (on b44 b78)
    (on b78 b59)
    (on b59 b48)
    (on b48 b41)
    (on b41 b12)
    (on b12 b54)
    (on-table b54)
    (clear b14)
    (on b14 b1)
    (on b1 b5)
    (on b5 b61)
    (on b61 b72)
    (on-table b72)
    (clear b4)
    (on-table b4)
    (clear b40)
    (on b40 b29)
    (on b29 b7)
    (on b7 b22)
    (on b22 b36)
    (on b36 b76)
    (on-table b76)
    (clear b43)
    (on b43 b18)
    (on b18 b68)
    (on b68 b32)
    (on b32 b60)
    (on b60 b53)
    (on b53 b17)
    (on b17 b62)
    (on-table b62)
    (clear b74)
    (on b74 b34)
    (on b34 b3)
    (on b3 b58)
    (on b58 b52)
    (on b52 b8)
    (on b8 b67)
    (on b67 b6)
    (on b6 b30)
    (on-table b30)
    (clear b56)
    (on b56 b39)
    (on b39 b73)
    (on b73 b81)
    (on b81 b45)
    (on b45 b15)
    (on b15 b19)
    (on b19 b51)
    (on b51 b64)
    (on b64 b21)
    (on b21 b70)
    (on b70 b11)
    (on b11 b87)
    (on b87 b79)
    (on b79 b13)
    (on b13 b49)
    (on b49 b84)
    (on b84 b42)
    (on b42 b65)
    (on b65 b46)
    (on-table b46)
    (clear b28)
    (on b28 b50)
    (on b50 b55)
    (on b55 b82)
    (on b82 b86)
    (on-table b86))
 (:goal  (and 
    (clear b3)
    (on b3 b5)
    (on b5 b6)
    (on b6 b4)
    (on b4 b2)
    (on b2 b1)
    (on b1 b8)
    (on b8 b7)
    (on-table b7))))

; plan
1. (unstack b74 b34)
   deleted: (on b74 b34) (clear b74) (arm-empty)
   added: (holding b74) (clear b34)
   goals met: 0 of 9
2. (putdown b74)
   deleted: (holding b74)
   added: (clear b74) (arm-empty) (on-table b74)
   goals met: 0 of 9
3. (unstack b34 b3)
   deleted: (on b34 b3) (clear b34) (arm-empty)
   added: (holding b34) (clear b3)
   goals met: 1 of 9
4. (putdown b34)
   deleted: (holding b34)
   added: (clear b34) (arm-empty) (on-table b34)
   goals met: 1 of 9
5. (unstack b40 b29)
   deleted: (on b40 b29) (clear b40) (arm-empty)
   added: (holding b40) (clear b29)
   goals met: 1 of 9
6. (putdown b40)
   deleted: (holding b40)
   added: (clear b40) (arm-empty) (on-table b40)
   goals met: 1 of 9
7. (unstack b29 b7)
   deleted: (on b29 b7) (clear b29) (arm-empty)
   added: (holding b29) (clear b7)
   goals met: 1 of 9
8. (putdown b29)
   deleted: (holding b29)
   added: (clear b29) (arm-empty) (on-table b29)
   goals met: 1 of 9
9. (unstack b7 b22)
   deleted: (on b7 b22) (clear b7) (arm-empty)
   added: (holding b7) (clear b22)
   goals met: 1 of 9
10. (putdown b7)
   deleted: (holding b7)
   added: (clear b7) (arm-empty) (on-table b7)
   goals met: 2 of 9
11. (unstack b3 b58)
   deleted: (on b3 b58) (clear b3) (arm-empty)
   added: (holding b3) (clear b58)
   goals met: 1 of 9
12. (putdown b3)
   deleted: (holding b3)
   added: (clear b3) (arm-empty) (on-table b3)
   goals met: 2 of 9
13. (unstack b58 b52)
   deleted: (on b58 b52) (clear b58) (arm-empty)
   added: (holding b58) (clear b52)
   goals met: 2 of 9
14. (putdown b58)
   deleted: (holding b58)
   added: (clear b58) (arm-empty) (on-table b58)
   goals met: 2 of 9
15. (unstack b52 b8)
   deleted: (on b52 b8) (clear b52) (arm-empty)
   added: (holding b52) (clear b8)
   goals met: 2 of 9
16. (putdown b52)
   deleted: (holding b52)
   added: (clear b52) (arm-empty) (on-table b52)
   goals met: 2 of 9
17. (unstack b8 b67)
   deleted: (on b8 b67) (clear b8) (arm-empty)
   added: (holding b8) (clear b67)
   goals met: 2 of 9
18. (stack b8 b7)
   deleted: (clear b7) (holding b8)
   added: (arm-empty) (clear b8) (on b8 b7)
   goals met: 3 of 9
19. (unstack b67 b6)
   deleted: (on b67 b6) (clear b67) (arm-empty)
   added: (holding b67) (clear b6)
   goals met: 3 of 9
20. (putdown b67)
   deleted: (holding b67)
   added: (clear b67) (arm-empty) (on-table b67)
   goals met: 3 of 9
21. (unstack b6 b30)
   deleted: (on b6 b30) (clear b6) (arm-empty)
   added: (holding b6) (clear b30)
   goals met: 3 of 9
22. (stack b6 b4)
   deleted: (clear b4) (holding b6)
   added: (arm-empty) (clear b6) (on b6 b4)
   goals met: 4 of 9
23. (unstack b14 b1)
   deleted: (on b14 b1) (clear b14) (arm-empty)
   added: (holding b14) (clear b1)
   goals met: 4 of 9
24. (putdown b14)
   deleted: (holding b14)
   added: (clear b14) (arm-empty) (on-table b14)
   goals met: 4 of 9
25. (unstack b1 b5)
   deleted: (on b1 b5) (clear b1) (arm-empty)
   added: (holding b1) (clear b5)
   goals met: 4 of 9
26. (stack b1 b8)
   deleted: (clear b8) (holding b1)
   added: (arm-empty) (clear b1) (on b1 b8)
   goals met: 5 of 9
27. (pickup b3)
   deleted: (clear b3) (on-table b3) (arm-empty)
   added: (holding b3)
   goals met: 4 of 9
28. (stack b3 b5)
   deleted: (clear b5) (holding b3)
   added: (arm-empty) (clear b3) (on b3 b5)
   goals met: 6 of 9
29. (unstack b80 b57)
   deleted: (on b80 b57) (clear b80) (arm-empty)
   added: (holding b80) (clear b57)
   goals met: 6 of 9
30. (putdown b80)
   deleted: (holding b80)
   added: (clear b80) (arm-empty) (on-table b80)
   goals met: 6 of 9
31. (unstack b57 b37)
   deleted: (on b57 b37) (clear b57) (arm-empty)
   added: (holding b57) (clear b37)
   goals met: 6 of 9
32. (putdown b57)
   deleted: (holding b57)
   added: (clear b57) (arm-empty) (on-table b57)
   goals met: 6 of 9
33. (unstack b37 b24)
   deleted: (on b37 b24) (clear b37) (arm-empty)
   added: (holding b37) (clear b24)
   goals met: 6 of 9
34. (putdown b37)
   deleted: (holding b37)
   added: (clear b37) (arm-empty) (on-table b37)
   goals met: 6 of 9
35. (unstack b24 b25)
   deleted: (on b24 b25) (clear b24) (arm-empty)
   added: (holding b24) (clear b25)
   goals met: 6 of 9
36. (putdown b24)
   deleted: (holding b24)
   added: (clear b24) (arm-empty) (on-table b24)
   goals met: 6 of 9
37. (unstack b25 b35)
   deleted: (on b25 b35) (clear b25) (arm-empty)
   added: (holding b25) (clear b35)
   goals met: 6 of 9
38. (putdown b25)
   deleted: (holding b25)
   added: (clear b25) (arm-empty) (on-table b25)
   goals met: 6 of 9
39. (unstack b35 b66)
   deleted: (on b35 b66) (clear b35) (arm-empty)
   added: (holding b35) (clear b66)
   goals met: 6 of 9
40. (putdown b35)
   deleted: (holding b35)
   added: (clear b35) (arm-empty) (on-table b35)
   goals met: 6 of 9
41. (unstack b66 b33)
   deleted: (on b66 b33) (clear b66) (arm-empty)
   added: (holding b66) (clear b33)
   goals met: 6 of 9
42. (putdown b66)
   deleted: (holding b66)
   added: (clear b66) (arm-empty) (on-table b66)
   goals met: 6 of 9
43. (unstack b33 b16)
   deleted: (on b33 b16) (clear b33) (arm-empty)
   added: (holding b33) (clear b16)
   goals met: 6 of 9
44. (putdown b33)
   deleted: (holding b33)
   added: (clear b33) (arm-empty) (on-table b33)
   goals met: 6 of 9
45. (unstack b16 b2)
   deleted: (on b16 b2) (clear b16) (arm-empty)
   added: (holding b16) (clear b2)
   goals met: 6 of 9
46. (putdown b16)
   deleted: (holding b16)
   added: (clear b16) (arm-empty) (on-table b16)
   goals met: 6 of 9
47. (unstack b2 b27)
   deleted: (on b2 b27) (clear b2) (arm-empty)
   added: (holding b2) (clear b27)
   goals met: 6 of 9
48. (stack b2 b1)
   deleted: (clear b1) (holding b2)
   added: (arm-empty) (clear b2) (on b2 b1)
   goals met: 7 of 9
49. (unstack b6 b4)
   deleted: (on b6 b4) (clear b6) (arm-empty)
   added: (holding b6) (clear b4)
   goals met: 6 of 9
50. (putdown b6)
   deleted: (holding b6)
   added: (clear b6) (arm-empty) (on-table b6)
   goals met: 6 of 9
51. (pickup b4)
   deleted: (clear b4) (on-table b4) (arm-empty)
   added: (holding b4)
   goals met: 6 of 9
52. (stack b4 b2)
   deleted: (clear b2) (holding b4)
   added: (arm-empty) (clear b4) (on b4 b2)
   goals met: 7 of 9
53. (pickup b6)
   deleted: (clear b6) (on-table b6) (arm-empty)
   added: (holding b6)
   goals met: 7 of 9
54. (stack b6 b4)
   deleted: (clear b4) (holding b6)
   added: (arm-empty) (clear b6) (on b6 b4)
   goals met: 8 of 9
55. (unstack b3 b5)
   deleted: (on b3 b5) (clear b3) (arm-empty)
   added: (holding b3) (clear b5)
   goals met: 6 of 9
56. (putdown b3)
   deleted: (holding b3)
   added: (clear b3) (arm-empty) (on-table b3)
   goals met: 7 of 9
57. (unstack b5 b61)
   deleted: (on b5 b61) (clear b5) (arm-empty)
   added: (holding b5) (clear b61)
   goals met: 7 of 9
58. (stack b5 b6)
   deleted: (clear b6) (holding b5)
   added: (arm-empty) (clear b5) (on b5 b6)
   goals met: 8 of 9
59. (pickup b3)
   deleted: (clear b3) (on-table b3) (arm-empty)
   added: (holding b3)
   goals met: 7 of 9
60. (stack b3 b5)
   deleted: (clear b5) (holding b3)
   added: (arm-empty) (clear b3) (on b3 b5)
   goals met: 9 of 9
